---
kind: method
id: M:Autodesk.Revit.DB.GroupType.GetAvailableAttachedDetailGroupTypeIds
source: html/f1ad6c3a-aea1-fa43-b322-1e90abea12fe.htm
---
# Autodesk.Revit.DB.GroupType.GetAvailableAttachedDetailGroupTypeIds Method

Returns the attached detail groups available for this element group type.

## Syntax (C#)
```csharp
public ISet<ElementId> GetAvailableAttachedDetailGroupTypeIds()
```

## Returns
Returns the collection of attached detail group Ids that match this group's type.